app/controllers/inscricaos_controller.rb

SELECT * FROM `participantes` WHERE (`participantes`.`matricula` = '5313') LIMIT 1
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` = 536) LIMIT 1
---
  def checar
    if params[:matricula]
      participante = Participante.find_by_matricula(params[:matricula])
      @inscricao = Inscricao.find_by_participante_id(participante)

SELECT * FROM `participantes` WHERE (`participantes`.`matricula` = '5313') LIMIT 1
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` = 536) LIMIT 1
---
  def confirmacao
    participante = Participante.find_by_matricula(params[:matricula])
    @inscricao = Inscricao.find_by_participante_id(participante.id)

SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 2)
---
  def show
    @inscricao = Inscricao.find(params[:id])

SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` IS NULL) LIMIT 1
SELECT * FROM `inscricaos`
SELECT * FROM `participantes` ORDER BY nome ASC
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 600) ORDER BY nome ASC
---
  def new
    @inscricao = Inscricao.find_by_participante_id(params[:participante])
    if @inscricao.present?
      @participante = Participante.find(@inscricao.participante_id)

SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 1)
---
  def edit
    @inscricao = Inscricao.find(params[:id])

SELECT * FROM `participantes` WHERE (`participantes`.`id` = 525)
SELECT * FROM `inscricaos` WHERE (`inscricaos`.`participante_id` = '525') LIMIT 1
---
  def sel_participa
    @dadosparticipa = Participante.find(params[:inscricao_participante_id])
    @inscricao = Inscricao.find_by_participante_id(params[:inscricao_participante_id])

INSERT INTO `inscricaos` (`updated_at`, `opcao1`, `opcao2`, `participante_id`, `data_inscricao`, `created_at`, `inscrito`, `periodo_opcao1`, `periodo_opcao2`) VALUES('2012-08-08 18:14:44', 48, 51, 536, '2012-08-08 15:14:44', '2012-08-08 18:14:44', NULL, 'Matutino', 'Vespertino')
---
  def create
    @inscricao = Inscricao.new(params[:inscricao])
    @inscricao.data_inscricao = Time.now
    respond_to do |format|
      if @inscricao.save

SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 1)
UPDATE `inscricaos` SET `periodo_opcao1` = 'Vespertino', `periodo_opcao2` = 'Noturno', `updated_at` = '2012-08-08 17:18:21' WHERE `id` = 1
---
  def update
    @inscricao = Inscricao.find(params[:id])


    respond_to do |format|
      if @inscricao.update_attributes(params[:inscricao])

SELECT * FROM `inscricaos`
---
 def por_curso
   @search = Inscricao.search(params[:search])

SELECT * FROM `cursos` WHERE (`cursos`.`id` = 1)
SELECT * FROM `cursos` ORDER BY nome ASC
SELECT * FROM `inscricaos` INNER JOIN `cursos_inscricaos` ON `inscricaos`.id = `cursos_inscricaos`.inscricao_id WHERE (`cursos_inscricaos`.curso_id = 1 )
SELECT * FROM `unidades` WHERE (id in (42,43,44,45,46,47,48,49,50,51))
---
  def gera_pdf
   @search = Curso.find(params[:curso])
   unless session[:unidade] == 'unidade'
     @cursos_inscricaos = Inscricao.all({:include => 'cursos',:conditions => [ 'cursos.id =? ', @search.id]})
     @contador = Inscricao.all(:include => 'cursos',:conditions => [ 'cursos.id =? ', @search.id])
   else
     @cursos_inscricaos = Inscricao.all({:include => 'cursos',:conditions => [ 'cursos.id =? and (inscricaos.opcao1 = ? and inscricaos.periodo_opcao1 = ?)', @search.id,session[:unidade], session[:opcao] ], :order =>"inscricaos.id"})

SELECT * FROM `cursos` ORDER BY nome ASC
SELECT * FROM `cursos` WHERE (`cursos`.`id` = 1)
SELECT * FROM `unidades` WHERE (id in (42,43,44,45,46,47,48,49,50,51))
SELECT * FROM `inscricaos`
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 42)
SELECT DISTINCT `inscricaos`.id FROM `inscricaos` LEFT OUTER JOIN `cursos_inscricaos` ON `cursos_inscricaos`.inscricao_id = `inscricaos`.id LEFT OUTER JOIN `cursos` ON `cursos`.id = `cursos_inscricaos`.curso_id WHERE (cursos.id =1 and (inscricaos.opcao1 = NULL and inscricaos.periodo_opcao1 = NULL)) LIMIT 0, 10
SELECT count(DISTINCT `inscricaos`.id) AS count_all FROM `inscricaos` LEFT OUTER JOIN `cursos_inscricaos` ON `cursos_inscricaos`.inscricao_id = `inscricaos`.id LEFT OUTER JOIN `cursos` ON `cursos`.id = `cursos_inscricaos`.curso_id WHERE (cursos.id =1 and (inscricaos.opcao1 = '45' and inscricaos.periodo_opcao1 = 'Vespertino'))
---
 def listagem
   if params[:curso].present?
     session[:opcao] = params[:periodo_opcao1]
     session[:unidade] = params[:curso][:unidade]
     @search = Curso.find(params[:curso][:get])
     unless session[:unidade].present?
       #@cursos_inscricaos = Inscricao.paginate(:all, {:page => params[:page],:per_page => 10, :include => 'cursos',:conditions => [ 'cursos.id =? ', @search.id]})
       @inscricao=@contador = Inscricao.all(:include => 'cursos',:conditions => [ 'cursos.id =? ', @search.id])
     else
       #@cursos_inscricaos = Inscricao.paginate(:all, {:page => params[:page],:per_page => 10, :include => 'cursos',:conditions => [ 'cursos.id =? and (inscricaos.opcao1 = ? and inscricaos.periodo_opcao1 = ?)', @search.id,session[:unidade], session[:opcao] ]})
       @inscricao=@contador = Inscricao.all(:include => 'cursos',:conditions => [ 'cursos.id =? and (inscricaos.opcao1 = ? and inscricaos.periodo_opcao1 = ?)', @search.id,session[:unidade], session[:opcao] ])
     end
     @cursos_inscricaos = @inscricao.paginate({:page => params[:page],:per_page => 10})

SELECT * FROM `inscricaos`
---
 def estatistica
    @cursos = Curso.find(:all, :order => 'nome ASC')
    @inscricaos = Inscricao.all

SELECT * FROM `unidades` WHERE (id in (42,43,44,45,46,47,48,49,50,51))
---
  def load_locais
    @locais = Unidade.all(:conditions => ["id in (42,43,44,45,46,47,48,49,50,51)"])

SELECT * FROM `inscricaos` WHERE (`inscricaos`.`id` = 536)
---
  def load_inscricaos
    @inscricaos = Inscricao.find(:all)

SELECT * FROM `cursos` WHERE (`cursos`.`id` IN (1,10,2,3,4))
---
  def load_cursos
    @cursos = Curso.find(:all, :order => 'nome ASC')

SELECT * FROM `participantes` ORDER BY nome ASC
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 5313)
---
  def load_participantes
    if params[:participante].present?
      @participante = Participante.find(params[:participante], :order => 'nome ASC')