app/controllers/participantes_controller.rb

  def addemail
    @participante = Participante.find(params[:id])
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 536)

  def update_email
    @participante = Participante.find(params[:id])
    respond_to do |format|
      @participante.email = params[:email]
      @participante.telefone = params[:telefone]
      @participante.cel = params[:cel]
      if @participante.save
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 536)
UPDATE `participantes` SET `telefone` = '', `email` = 'alexandrejr.soares@gmail.com', `updated_at` = '2012-08-08 16:59:27', `cel` = 92631244 WHERE `id` = 82

  def busca_por_turno
    if params[:turno].present?
      @turno_op = Inscricao.paginate(:all, :conditions => ["periodo_opcao1 = ? or periodo_opcao2 =?", params[:turno], params[:turno]],:per_page =>10,:page => params[:page])
---
SELECT * FROM `inscricaos` WHERE (periodo_opcao1 = 'Matutino' or periodo_opcao2 ='Matutino') LIMIT 0, 10

  def show
    @participante = Participante.find(params[:id])
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 536)

  def edit
    @participante = Participante.find(params[:id])
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 536)

  def create
    @participante = Participante.new(params[:participante])

    respond_to do |format|
      if @participante.save
---
INSERT INTO `participantes` (`nome`, `num`, `obs`, `updated_at`, `funcao`, `cidade`, `complemento`, `unidade_id`, `bairro`, `cel`, `email`, `created_at`, `matricula`, `endereco`, `telefone`, `tipo_participante`) VALUES('ALEXANDRE SOARES', NULL, '', '2012-08-09 11:19:43', NULL, 'AMERICANA', NULL, 31, 'JD SAO PAULO', 92631244, 'corujao831@hotmail.com', '2012-08-09 11:19:43', 14098, 'IMBUIAS', '', 1)

  def update
    @participante = Participante.find(params[:id])
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 1086)

  def lista_participante
    @inscricao = Inscricao.find_by_participante_id(params[:participante_participante_id])
---
SELECT * FROM `inscricaos` WHERE (id = '161') AND (`inscricaos`.`participante_id` IS NULL) LIMIT 1

  def load_unidades
    @unidades = Unidade.find(:all, :order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 42)

  def load_participantes
    @participantes = Participante.find(:all, :order => 'nome ASC')
---
SELECT * FROM `participantes` WHERE (`participantes`.`id` = 536)