app/controllers/unidades_controller.rb

SELECT * FROM `unidades` WHERE (unidades.tipo = 0)
---
  def index
    @unidades = Unidades.find(:all)